[
  {
    "id": 1,
    "name": "Grilled Cheese",
    "description": "A quick and easy, classic, crunchy, and gooey sandwich.",
    "ingredients": "2 slices of bread \n 2 T mayonnaise (approximate) \n 1-2 slices American cheese",
    "steps": "Preheat skillet over medium heat \n Spread a thin layer of mayonnaise on one side of each piece of bread \n Assemble sandwich with cheese slice(s) in between the bread with the mayonnaise on the outside of the sandwich \n Place the sandwich in the pan and flip when desired doneness has been reached (about 2 minutes) \n Repeat on the other side \n Remove from pan, cut, and enjoy!",
    "notes": "Enjoy with a bowl of Tomato Soup!"
  },
  {
    "id": 2,
    "name": "Tomato Soup",
    "description": "A classic comfort soup that pairs well with a grilled cheese sandwich",
    "ingredients": "4 T unsalted butter\n1/2 onion (cut in wedges)\n28 oz canned tomatoes (whole or crushed)\n1 1/2 c water or stock\nsalt to taste",
    "steps": "Melt the butter over medium heat in a large sauce pan.\nAdd the remaining ingredients and bring to a simmer.\nCook uncovered about 40 minutes, stirring occasionally. Be sure to taste as you go and add salt if needed.\nBlend the soup using an immersion or standing blender. (Use caution as the soup is HOT.)\nEnjoy!",
    "notes": "This recipe is inspired by inspiredtaste.net's recipe\nConsider adding basil, rosemary, cream, and/or cheese for a different flavor and texture."
  },
  {
    "id": 3,
    "name": "Potato Soup",
    "description": "Grandma's go-to veggie and chicken soup.",
    "ingredients": "2 T oil or bacon grease (optional)\n1-2 carrots (shredded or sliced)\n1-2 celery stalks (sliced)\n2-4 cloves garlic (minced)\n1 small onion (diced)\n6-8 russet potatoes(washed and cubed)\n6-8 boneless, skinless chicken tenders*\n2 T Italian seasoning\n1 T Oregano\n 2 t basil\n3 t chicken bouillon\n2-3 t beef bouillon\n2 t salt\n1 t pepper",
    "steps": "Heat a dutch oven or large pot over medium-high heat. Add oil or fat if using; alternatively, you can add a few T of water for the vegetables to steam in.\nAdd the carrots, celery, and onion to the pot.\nWhile the veggies steam, you can prepare your potatoes. \nAs you prepare your potatoes, place the cubes in a large bowl of cold water to prevent browning.\nWhen the veggies have softened, add the garlic and cook until fragrant (about 30-60 sec).\nCarefully pour your water and potatoes into the pot and add the rest of the ingredients.\nBring to a boil, add chicken, then cover and simmer about 20 min.\nWhen chicken has fully cooked, remove from the pot, cut into cubes, and return to the soup. If the chicken cubes are still raw, heat them until cooked thoroughly (no pink should be visible).\nRemember to taste as you go and add salt, pepper, or other seasonings as needed.\nEnjoy your soup!",
    "notes": "Pre-preparing the veggies in bulk and freezing makes this recipe even faster! If you cook them this way, you can just add the frozen veggies straight into the pot and don't need to add any fat; they'll steam in their own juices, releasing lots of flavor. This comes out to 1/4 - 1/2 cup of each.\nFor the chicken, you can use any cut you like and can even cook from frozen.\nYou can use any stock additive you like; if you don't want to use bouillon, you can use pre-made stock.\nThis goes great with grilled cheese or corn bread.\nIdeas to try: add corn, cheese, rosemary, green chilies, red pepper flakes, and/or sour cream to change it up."
  },
  {
    "id": 4,
    "name": "Oatmeal",
    "description": "A warming and filling breakfast to start your day.",
    "ingredients": "1/2 c rolled oats \n 2 T peanut butter \n 1/2 t vanilla extract \n 1/4-1/2 t cinnamon \n 1 t brown sugar \n pinch salt \n OPT 1 T flax seed \n OPT 1 T wheat germ \n OPT 1/2 banana mashed",
    "steps": "Combine all ingredients except brown sugar, flax seed, and wheat germ (if using) \n Add 3/4 -1 c water \n Microwave 90 seconds \n Add additional ingredients (if using). Stir until peanut butter is fully incorporated. \n Allow to sit 1-2 minutes to thicken before enjoying",
    "notes": "Flax seed and wheat germ have cholesterol-lowering properties."
  },
  {
    "id": 5,
    "name": "Guacamole",
    "description": "A creamy, chunky, delicious avocado concoction perfect for dipping, spreading, or topping!",
    "ingredients": "2-3 fresh avocados* \n 2 T sour cream \n 1-2 T lemon or lime juice \n salsa (to taste) \n  paprika (to taste) \n garlic powder (to taste) \n onion powder (to taste) \n salt and pepper",
    "steps": "Halve avocado and scoop out the green flesh into a medium sized bowl, discarding the pit \n Add the rest of the ingredients, tasting as you go**",
    "notes": "*To check avocados for freshness, gently squeeze the fruit. It should be soft with a little give. \n **All measurements are approximate, experiment and find the combination you like best! You can try dividing the mashed avocado between bowls and adding more or less of each ingredient to see how each impacts the taste."
  },
  {
    "id": 6,
    "name": "Knock-off Stroganoff",
    "description": "A warm dish of creamy noodles with ground beef, mushrooms, and egg noodles.",
    "ingredients": "1-2 lb ground beef\n2 T butter\n2 cloves garlic (minced)\n1 lg onion (diced)\n8-16 oz mushrooms (sliced)\n1/4 c flour\n3 c beef broth*\n1 t paprika\n1 T dijon mustard\n1 T worcestershire sauce\n2 T ranch dressing seasoning (opt)\n1/2 c sour cream\n1 pkg egg noodles (cooked al dente)",
    "steps": "Brown ground beef in large pot over medium-high heat.\nRemove the meat from the pan and set aside.\nMelt butter in the same pan and sautee the garlic, onion, and mushrooms.\nSprinkle the flour over the vegetables and stir, cooking about 1 min.\nTurn heat to low and slowly whisk in broth, dissolving the flour.\nSimmer and thicken (5-10 min)\nAdd the remaining ingredients except the noodles and simmer about 5 minutes.\nServe over noodles and enjoy!",
    "notes": "If you don't have beef broth, you can use bouillon as a substitute.\nYou can also add the noodles into the mixture if you prefer."
  },
  {
    "id": 7,
    "name": "Spaghetti Sauce",
    "description": "A classic better-than-jarred meat and tomato sauce to impress and satisfy your guests.",
    "ingredients": "1 pkg italian sausage (optional)\n1-2 lb ground beef\n4-6 cloves garlic (mined)\n1 small onion (diced)\n2 14.5 oz cans diced tomatoes\n2 14.5 oz cans tomato sauce\n2 6 oz cans tomato paste\n1 T italian seasoning\n1/2-1 T dried basil\n2-3 bay leaves\n1/2-1 c parmesan cheese (the stuff in the can is fine!)\n2-4 T brown sugar\nsalt & pepper to taste",
    "steps": "(Optional) Roll sausage into ~1.5 inch balls and sear in a dutch oven or large pan over medium high heat and set aside. They don't need to be cooked through.\nCook the ground beef in the same pan, adding the onions and garlic when nearly all the pink is gone.\nAdd in the tomatoes and seasonings. (The brown sugar helps to cut some of the acidity.)\nReturn the sausage to the sauce. (Pre-cooking it helps to prevent the sausage over-powering the flavors, but you could also brown it with the beef if you prefer.)\nBring the sauce to a boil, then lower to a simmer and cook for 30 min - 2 hours. The longer it sits, the more the flavors will meld. Be sure to stir occasionally to prevent burning.\nRemove the bay leaves and serve over noodles.",
    "notes": "Adding garlic in at the end will provide a more powerful flavor; try it both ways!\nTry other herbs like rosemary or thyme for a different flavor profile."
  },
  {
    "id": 8,
    "name": "Egg Drop Soup",
    "description": "A yummy, warming soup!",
    "ingredients": "4 c chicken broth\n1/2 t garlic powder\n1 t ginger powder\n3 eggs\n2 T corn starch",
    "steps": "Heat broth to boiling after adding cornstarch and seasonings\nwhen boiling, stir in whisked eggs\nenjoy!",
    "notes": "Can be served with green onions"
  },
  {
    "id": 9,
    "name": "Beer Bread",
    "description": "A no-knead recipe for a quick, crusty loaf of bread.",
    "ingredients": "3 c sifted flour\n3 t baking powder\n1 t salt\n1/4 c sugar\n12 oz beer\n1/4 c melted butter",
    "steps": "Preheat oven to 375 F.\nMix all ingredients in a bowl EXCEPT the butter.\nPour the mixture into a greased loaf pan.\nPour the melted butter over the mixture.\nBake 1 hour.\nRemove from pan and cool at least 15 min before removing from the pan.",
    "notes": "Try this recipe with different types of beer to see how it changes the flavor!"
  },
  {
    "id": 10,
    "name": "Red Wine Pork Tenderloin",
    "description": "A mix, wait, and enjoy slow-cooker meal that will impress your mother-in-law.",
    "ingredients": "~1 1/4 lb pork tenderloin\n1 c water\n1 c red wine\n1 T Worcestershire sauce\n1 T garlic (minced; ~3 cloves)\n2 T dried minced onion\n2 t cornstarch\n1/2 t onion powder (or minced)\n1/2 t garlic powder\n1/2 t salt\n1/2 t sugar\n1/4 t paprika\n1/4 t pepper\nOPT: dash turmeric\nOPT: dash nutmeg ",
    "steps": "Place the pork in a slow-cooker.\nAdd water, wine, and Worcestershire sauce.\nTop with the minced garlic.\nCombine the remaining ingredients in a bowl then sprinkle on top of the pork.\nCook on low 4-5 hours (flip after 3) or on high for 2-3 hours. (Internal temperature should be 145 F for safe consumption.)",
    "notes": "If you increase the amount of pork, you don't necessarily need to double or triple the ingredients. Start with the basic recipe amounts and then increase as needed. (Wine should not completely cover the pork and the toppings should just cover the surface of the pork.)\nTo turn the remaining liquid into a gravy, off heat, remove about 1/4 c, add 1-2 T cornstarch to that to make a slurry, then stir it back in. After it's fully incorporated, warm the gravy, stirring frequently until it reaches your desired consistency. "
  },
  {
    "id": 11,
    "name": "Quick and Easy Alfredo Sauce",
    "description": "It's easier than you think to make homemade alfredo sauce!",
    "ingredients": "1/4 c butter\n1 c heavy cream\n1 clove garlic, crushed\n1 1/2 parmesan (freshly grated)\nOPT 1/4 c parsley (fresh, chopped)",
    "steps": "Melt the butter over medium-low heat.\nAdd the cream, bring to a simmer and continue simmering for 5 minutes. (Do not let it come to a boil.)\nAdd the garlic and cheese, whisking quickly and heating until the cheese melts.\nStir in the parsley if using.\nServe over freshly cooked pasta.",
    "notes": ""
  },
  {
    "id": 12,
    "name": "Austin's Mamaw's Fudge",
    "description": "A treat sure to make your sweet tooth happy.",
    "ingredients": "5 c sugar\n2 sticks butter\n1 can evaporated milk\n24 large marshmallows\n2 c chocolate chips",
    "steps": "Combine sugar, butter, and milk in a pan and heat until it boils. (Be sure to stir frequently so it doesn't stick to the bottom or sides of the pan.)\nBoil for 12 minutes, stirring constantly.\nRemove from the heat and mix in the marshmallows and chocolate chips.\nPour into a buttered dish and let cool.\nCut and enjoy!",
    "notes": ""
  },
  {
    "id": 13,
    "name": "Nonna's Sour Cream Chicken ",
    "description": "A creamy and nostalgic chicken dish that goes great with rice.",
    "ingredients": "6 boneless, skinless chicken breast halves\n1 can (10 oz) cream of mushroom soup\n1 c light sour cream (regular is fine)\n1/3 c cooking white wine\n1 can (4 oz) sliced mushrooms, drained\nsalt and pepper\n2 c cooked rice",
    "steps": "Preheat the oven to 325 F.\nIn a 3-qt casserole dish, arrange the chicken and sprinkle lightly with salt and pepper. \nIn a small bowl, combine the soup, sour cream, wine, and mushrooms. Mix well.\nPour mixture over the chicken.\nBake uncovered for ~90 min or until cooked through (165 F internal).\nServe over hot cooked rice.",
    "notes": "Try this recipe with other cuts of chicken; chicken thighs are nice and juicy!\nIf you don't have cooking wine, a dry white wine works well.\nTry substituting freshly sautéed sliced mushrooms for the canned mushrooms to enhance the flavor!"
  },
  {
    "id": 14,
    "name": "Nana's Porkchop Rice Casserole",
    "description": "A filling, creamy casserole to feed the whole family.",
    "ingredients": "1 pack of ~10 thin porkchops; cut into bite-sized pieces)\n1 can each cream of: chicken, celery, mushroom\n3 soup-can-fuls of instant rice\n3 1/2 soup-can-fuls of milk\n1 c melted butter\n",
    "steps": "Preheat the oven to 350 F.\nPut the porkchops in the bottom of a large roasting pan in an even layer.\nCombine the soups, rice, milk, and butter, then pour the mixture over the meat.\nCover with foil.\nBake 90 min.\nOptional: Serve with extra butter on top.",
    "notes": "Feel free to add seasonings! Salt, pepper, garlic, Italian seasoning... the sky's the limit!"
  },
  {
    "id": 15,
    "name": "Renny's Asparagus Casserole",
    "description": "A family classic at holiday gatherings.",
    "ingredients": "4-5 boiled eggs, sliced\n2 cans of asparagus (~14.5 oz ea)\n4-6 oz Velveeta cheese, cubed\n2 T cornstarch\nRuffles chips, crushed",
    "steps": "Drain the liquid from the asparagus into a pot and add the cornstarch. Mix until smooth, then heat until it has thickened.\nSlowly add the cheese until completely smooth, then remove from heat.\nPour the asparagus into a baking dish, then cover with the cheese mixture.\nTop with the sliced eggs then cover with crushed chips.\nBake at 350 F until the cheese is bubbling and the chips are lightly golden-brown.",
    "notes": "You can prepare this ahead of time and heat when ready."
  }
]
